tap "dagger/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "planetscale/tap"
brew "act"
brew "ast-grep"
brew "aws-iam-authenticator"
brew "xz"
brew "python@3.12"
brew "aws-sso-util"
brew "awscli"
brew "bat"
brew "boost"
brew "cairo"
brew "coreutils"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "doctl"
brew "duf"
brew "earthly"
brew "folly"
brew "fizz"
brew "wangle"
brew "fb303"
brew "edencommon"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "giflib"
brew "git"
brew "gitui"
brew "go"
brew "harfbuzz"
brew "gradle"
brew "htop"
brew "httpie"
brew "jpeg"
brew "jq"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeshark"
brew "libpq"
brew "pango"
brew "librsvg"
brew "minikube"
brew "mysql-client"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nushell"
brew "nvm"
brew "pipx"
brew "pkg-config"
brew "postgresql@14", restart_service: true
brew "python@3.10"
brew "ripgrep"
brew "sd"
brew "stow"
brew "telnet"
brew "terraformer"
brew "tfenv"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "watchman"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "dagger/tap/dagger"
brew "jesseduffield/lazydocker/lazydocker"
brew "planetscale/tap/pscale"
cask "arc"
cask "buttercup"
cask "clipy"
cask "datagrip"
cask "dbeaver-community"
cask "git-credential-manager"
cask "iterm2"
cask "lens"
cask "microsoft-remote-desktop"
cask "postman"
cask "pycharm-ce"
cask "rancher"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "ambooth.git-rename"
vscode "arjun.swagger-viewer"
vscode "ast-grep.ast-grep-vscode"
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "blanu.vscode-styled-jsx"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "clinyong.vscode-css-modules"
vscode "continue.continue"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "mariusalchimavicius.json-to-ts"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "nrwl.angular-console"
vscode "otovo-oss.htmx-tags"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-hebrew"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "undefined_publisher.sudolang-llm-support"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
