tap "ariga/tap"
tap "dagger/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "nikitabobko/tap"
tap "planetscale/tap"
tap "pulumi/tap"
tap "telepresenceio/telepresence"
brew "act"
brew "giflib"
brew "xz"
brew "jpeg-xl"
brew "ast-grep"
brew "aws-iam-authenticator"
brew "aws-sso-util"
brew "awscli"
brew "bat"
brew "bat-extras"
brew "boost"
brew "cairo"
brew "carapace"
brew "cocoapods"
brew "coreutils"
brew "dagger"
brew "deno"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "doctl"
brew "duf"
brew "earthly"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "openjdk"
brew "flyway"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "go"
brew "gradle"
brew "htop"
brew "httpie"
brew "jj"
brew "jpeg"
brew "jq"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeshark"
brew "lazygit"
brew "libimobiledevice"
brew "libpq"
brew "librsvg"
brew "llm"
brew "minikube"
brew "mvfst"
brew "mysql@8.4", restart_service: :changed
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nushell"
brew "nvm"
brew "python@3.12"
brew "pipx"
brew "pkgconf"
brew "python@3.10"
brew "ripgrep"
brew "sd"
brew "starship"
brew "stow"
brew "telnet"
brew "terraform-docs"
brew "terraformer"
brew "tfenv"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "uv"
brew "watchman"
brew "xcodegen"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "jesseduffield/lazydocker/lazydocker"
brew "planetscale/tap/pscale"
brew "pulumi/tap/pulumi"
cask "arc"
cask "bruno"
cask "buttercup"
cask "clipy"
cask "datagrip"
cask "dbeaver-community"
cask "git-credential-manager"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "lens"
cask "microsoft-remote-desktop"
cask "mitmproxy"
cask "obsidian"
cask "postman"
cask "pycharm-ce"
cask "rancher"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "wave"
vscode "adpyke.codesnap"
vscode "ambooth.git-rename"
vscode "antfu.slidev"
vscode "arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "mariusalchimavicius.json-to-ts"
vscode "mathiasfrohlich.kotlin"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "nrwl.angular-console"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-hebrew"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
